app/views/static_pages/index.html.erb

<h2> Available Games by User E-mail </h2>
<% Game.available.each do |game| %>
<%= User.find(game.user_id).email %>
---
SELECT "games".* FROM "games"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]