app/views/pieces/show.html.erb


      	<%  @game.pieces.all.each do |piece| %>
---
SELECT "pieces".* FROM "pieces" WHERE "pieces"."game_id" = $1  [["game_id", 11]]