app/views/games/show.html.erb

SELECT "pieces".* FROM "pieces" WHERE "pieces"."game_id" = $1  [["game_id", 11]]
---
      <td>
      	<%  @game.pieces.all.each do |piece| %>