app/controllers/games_controller.rb

  def new
  	@game=current_user.games.create(white_id: current_user.id, turn_number: 1)
---
INSERT INTO "games" ("white_id", "turn_number", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["white_id", 2], ["turn_number", 1], ["created_at", "2019-10-28 19:28:43.297960"], ["updated_at", "2019-10-28 19:28:43.297960"], ["user_id", 2]]

  def update
  	@game = Game.find(params[:id])
  	@game.update_attributes(black_id: current_user.id)
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "games" SET "black_id" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["black_id", 3], ["updated_at", "2019-10-28 20:28:51.883360"], ["id", 11]]