app/controllers/pieces_controller.rb

	def show
		@piece=Piece.find(params[:id])
		@game=Game.find(@piece.game_id)
---
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "pieces".* FROM "pieces" WHERE "pieces"."game_id" = $1  [["game_id", 11]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]